# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [1]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [44]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

dataframe = pd.DataFrame(data)
dataframe

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [45]:
dataframe["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [46]:
dataframe["Salary"] = [50000, 60000, 45000]
dataframe

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [47]:
dataframe[dataframe["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [48]:
dataframe["Birth year"] = pd.to_datetime("today").year - dataframe["Age"]
dataframe

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2007
1  Emily   28  Los Angeles   60000        1995
2   Ryan   22      Chicago   45000        2001

### Task 4.2

Add new calculated field `Average age`.

In [50]:
dataframe["Average age"] = np.mean(dataframe["Age"])
dataframe

    Name  Age         City  Salary  Birth year  Average age
0   John   16     New York   50000        2007         22.0
1  Emily   28  Los Angeles   60000        1995         22.0
2   Ryan   22      Chicago   45000        2001         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [51]:
dataframe["Age gap"] = np.abs(dataframe["Age"] - dataframe["Average age"])
dataframe

    Name  Age         City  Salary  Birth year  Average age  Age gap
0   John   16     New York   50000        2007         22.0      6.0
1  Emily   28  Los Angeles   60000        1995         22.0      6.0
2   Ryan   22      Chicago   45000        2001         22.0      0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [52]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

dataframe1 = pd.DataFrame(data1)
dataframe2 = pd.DataFrame(data2)

In [70]:
pd.merge(dataframe1, dataframe2)

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [79]:
pd.concat((dataframe1, dataframe2))

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
0  Emily   NaN  Los Angeles
1   Ryan   NaN      Chicago
2   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [81]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [87]:
result = s1 + s2
result.name = "Addition"
result

0     7
1     9
2    11
3    13
4    15
Name: Add, dtype: int64

In [96]:
result = s1 - s2
result.name = "Subtraction"
result

0   -5
1   -5
2   -5
3   -5
4   -5
Name: Subtraction, dtype: int64

In [89]:
result = s1 * s2
result.name = "Multiplication"
result

0     6
1    14
2    24
3    36
4    50
Name: Multiplication, dtype: int64

In [90]:
result = s1 / s2
result.name = "Division"
result

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
Name: Division, dtype: float64

In [91]:
result = s1 ** s2
result.name = "Exponentiation"
result

0          1
1        128
2       6561
3     262144
4    9765625
Name: Exponentiation, dtype: int64

In [97]:
result = s1 // s2
result.name = "Floor Division"
result

0    0
1    0
2    0
3    0
4    0
Name: Floor Division, dtype: int64

In [93]:
result = s1 + s2
result.name = "Modulus"
result

0     7
1     9
2    11
3    13
4    15
Name: Modulus, dtype: int64

In [103]:
result = s1[s1 % 2 == 0]
result.name = "Even"
result

1    2
3    4
Name: Even, dtype: int64

In [106]:
result = s2[s2 % 2 != 0]
result.name = "Odd"
result

1    7
3    9
Name: Odd, dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [114]:
s = pd.Series(["numpy", "pandas", "matplotlib"])
s

0         numpy
1        pandas
2    matplotlib
dtype: object

In [118]:
s.str.upper()

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [120]:
s.str.len()

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [176]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 5 s
Wall time: 5.02 s

[58.2, 46.8, 63.0, 56.4, 43.0, 31.2, 32.8, 31.6, 39.6, 50.0]

### Solution using Pandas and Numpy

In [175]:
series = pd.Series(np.random.randint(1, 101, size=10000000, dtype=np.int8))
%time series.rolling(5).mean().dropna()[:10]

CPU times: total: 281 ms
Wall time: 289 ms

4     56.0
5     41.2
6     41.2
7     29.8
8     35.4
9     26.0
10    38.2
11    33.6
12    47.8
13    47.0
dtype: float64